<?php
function getSetting($settingname='sitename'){
  return \App\SiteSetting::where('namesetting',$settingname)->get()[0]->value;
}

function checkIfImageIsexist($imageName,$pathImage='/public/website/bu_images/',$url='/website/bu_images/'){

  if ($imageName !='') {
      $path=base_path().$pathImage.$imageName;
    if (file_exists($path)) {
      return Request::root().$url.$imageName;
    }
  }else {

      return  getSetting('no_image');
  }
}

function uploadImage($request,$path='/public/website/bu_images/',$width='500',$height='362' ,$deleteFileWithName=''){
  if ($deleteFileWithName !='') {
  deleteImage(base_path().$path.'/'.$deleteFileWithName);
  }
$dim=getimagesize($request);
$fileName=$request->getClientOriginalName();
$request->move(
  base_path().$path,$fileName
);
if ($width=='500' && $height=='362') {
  $thumbPath=base_path().'/public/website/thumb/';
  $thumbPathNew=$thumbPath.$fileName;
  \Intervention\Image\Facades\Image::make(base_path().$path.'/'.$fileName)->resize('500','362')->save($thumbPathNew,100);
  if ($deleteFileWithName !='') {
  deleteImage($thumbPath.$deleteFileWithName);
  }
}

return $fileName;
}
function deleteImage($deleteFileWithName){
  if (file_exists($deleteFileWithName)) {
    \Illuminate\Support\Facades\File::delete($deleteFileWithName);
  }
}

function setActive($array ,$class="active"){
  if (!empty($array)) {
    $seg_array=[];
    foreach ($array as $key => $url) {
      if (Request::segment($key+1) == $url) {
        $seg_array[]=$url;
      }
    }
    if (count($seg_array)== count(Request::segments())) {
      if (isset($seg_array[0])) {
          return $class;
      }

    }
  }

}
function buforusercount($user_id,$status){
   return \App\Bu::where('bu_status',$status)->where('user_id',$user_id)->count();
}

function countBuAppendTostatus($status){
  return \App\Bu::where('bu_status',$status)->count();

}

function bu_type(){
  $array=[
    'شقه',
    'فيلا',
    'شاليه'

  ];
  return $array;
}


function bu_rent(){
  $array=[
    'تمليك',
    'ايجار'

  ];
  return $array;
}
function status(){
  $array=[

    'غير مفعل',
        'مفعل'

  ];
  return $array;
}

function roomnumber(){
  $array=[];
  for ($i=2; $i <41 ; $i++) {
  $array[$i]=$i;
  }
  return $array;
}
function searchnameField(){
  return [
   'bu_price'=>'سعر العقار',
   'bu_place'=>'منطقة العقار',
   'rooms'=>'عدد الغرف',
   'bu_type'=>'نوع العقار',
   'bu_rent'=>'نوع العملية',
   'bu_square'=>'مساحة العقار',
   'bu_price_from'=>'سعر العقار من ',
   'bu_price_to'=>'سعر العقار الي',

  ];
}

function contact(){
  return [
    '1'=>'اعجاب بالموقع',
    '2'=>'مشكلة',
    '3'=>'اقتراح',
    '4'=>'استفسار',

  ];
}

function unreadMessage(){
  return \App\ContactUs::where('view', 0)->get();
}

function countunreadMessage(){
  return \App\ContactUs::where('view',0)->count();

}

function bu_place(){

return[

"ابو الريش",
   "ابو سمبل",
         "ادفو",
   "البصيلية",
         "الرديسية",
   "السباعية",
         "دراو",
   "صحارى",
         "كلابشة",
   "كوم امبو",
         "مدينة أسوان",
   "نصر النوبة",

   "أبنوب",
   "أبو تيج",
         "أسيوط الجديدة",
   "البدارى",
         "الغنايم",
   "الفتح",
         "القوصيه",
   "ديروط",
         "ساحل سليم",
   "صدفا",
         "طيبة الجديدة",
   "مدينة أسيوط",
         "منفلوط",

   "أرمنت",
   "إسنا",
         "البياضية",
   "الزينية",
         "الطود",
   "القرنه",
         "مدينة الأقصر",

   "أبو تلات",
   "أبو قير",
         "الأزاريطة",
   "الإبراهيمية",
         "الحضرة",
   "السيوف",
         "الظاهرية",
   "العامرية",
         "العصافرة",
   "العطارين",
         "العوايد",
   "المعمورة",
         "المنتزه",
        "المندرة",
   "المنشية",
         "النخيل",
   "الورديان",
         "باكوس",
   "برج العرب",
         "بولكلي",
   "جليم",
         "رأس التين",
   "رشدي",
         "سان ستيفانو",
   "سبورتنج",
         "ستانلي",
         "سموحة",
   "سيدي بشر",
         "سيدي جابر",
         "شدس",
   "عجمي",
         "فلمنج",
   "فيكتوريا",
         "كرموز",
   "كفر عبدو",
         "كليوباترا",
   "لوران",
         "محرّم بيك",
         "محطة الرمل",
         "ميامي",

   "أبوصوير",
   "التل الكبير",
         "القصاصين",
   "القنطرة شرق",
         "القنطرة غرب",
   "فايد",
         "مدينة الإسماعيلية",

   "الجونة",
   "الغردقة",
         "القصير",
   "حلايب و شلاتين",
         "رأس غارب",
   "سفاجا",
         "سهل حشيش",
         "مرسى علم",

   "أبو المطامير",
   "أبو حمص",
         "إدكو",
   "الدلنجات",
         "الرحمانية",
         "المحمودية",
   "النوبارية الجديدة",
         "ايتاي البارود",
   "حوش عيسى",
         "دمنهور",
   "رشيد",
         "شبراخيت",
   "كفر الدوار",
         "كوم حمادة",
        "مركز بدر",
   "وادي النطرون",


   "أكتوبر",
   "أبو رواش",
         "أرض اللواء",
   "أوسيم",
         "إمبابة",
   "البدرشين",
         "البراجيل",
   "الحوامدية",
         "الدقى",
   "الشيخ زايد",
         "الصف",
   "العجوزة",
         "العياط",
        "الكيت كات",
   "المنصورية",
         "المنيب",
   "المهندسين",
         "الهرم",
   "الوراق",
         "بشتيل",
   "بولاق الدكرور",
         "ترسا",
   "جزيرة الدهب وكولدير",
         "حدائق 6 اكتوبر",
   "حدائق الاهرام",
         "حى الجيزة",
         "دهشور",
   "صفط اللبن",
         "غرب سوميد",
         "فيصل",
   "كرداسة",
         "مركز الجيزة",
   "مريوطية",
         "منيل شيحة",
   "ناهيا",

   "أجا",
   "أخطاب",
         "السنبلاوين",
   "الكردى",
         "المنزلة",
         "المنصورة",
   "المنصورة الجديدة",
         "بلقاس",
   "بني عبيد",
         "تمى الامديد",
   "جمصه",
         "دكرنس",
   "شربين",
         "طلخا",
        "مركز الجمالية",
   "مركز المطرية",
         "منية النصر",
         "ميت سلسيل",
         "ميت غمر",
         "نبروه",

   "العين السخنة",
   "حى الجناينر",
         "حى فيصل",
   "حي الأربعين",
         "حي السويس",
   "حي عتاقة",

   "أبو حماد",
   "أبو كبير",
         "أولاد صقر",
   "الإبراهيمية",
         "الحسينية",
         "الزقازيق",
   "الصالحية الجديدة",
         "العاشر من رمضان",
   "القرين",
         "القنايات",
   "بلبيس",
         "ديرب نجم",
   "فاقوس",
         "كفر صقر",
        "مشتول السوق",
   "منيا القمح",
         "ههيا",

   "السنطة",
   "المحلة الكبرى",
         "بسيون",
   "زفتى",
         "سمنود",
   "طنطا",
         "قطور ",

   "أطسا",
   "إبشواي",
         "الفيوم الجديدة",
   "سنورس",
         "طامية",
   "مدينة الفيوم",
         "يوسف الصديق",

   "الزاوية الحمراء ",
   "الزمالك",
         "السيدة زينب",
   "العاشر من رمضان",
         "العاصمة الإدارية الجديدة",
   "العباسية",
         "العبور",
   "القاهرة الجديدة - التجمع",
         "الماظة",
   "المرج",
         "المطرية",
   "المعادي",
         "المقطم",
        "المنيل",
   "النزهة الجديدة",
         "الوايلي",
   "جسر السويس",
         "حدائق القبة",
   "حدائق حلوان",
         "حلمية الزيتون",
   "حلوان",
         "دار السلام",
   "رمسيس و امتداد رمسيس",
         "روض الفرج",
   "زهراء المعادى",
         "شبرا",
         "شيراتون",
   "عزبة النخل",
         "عين شمس",
         "قصر النيل",
   "مدينة 15 مايو",
         "مدينة الرحاب",
   "مدينة السلام",
         "مدينة الشروق",
         "مدينة المستقبل",
   "مدينة بدر",
         "مدينة نصر",
         "مدينتي",
   "مصر الجديدة",
         "وسط القاهرة",

   "الخانكة",
   "الخصوص",
         "القناطر الخيرية",
   "بنها",
         "بهتيم",
   "شبرا الخيمة",
         "شبين القناطر",
         "طوخ",
         "قليوب",
         "قها",
   "كفر شكر",
         "مسطرد",

   "أشمون",
   "الباجور",
         "السادات",
   "الشهداء",
         "بركة السبع",
   "تلا",
         "سرس الليان",
         "شبين الكوم",
         "قويسنا",
         "منوف",

   "أبو قرقاص",
   "العدوة",
         "المنيا الجديدة",
   "بني مزار",
         "دير مواس",
   "سمالوط",
         "مدينة المنيا",
         "مطاي",
         "مغاغة",
         "ملوي",

   "الخارجة",
   "الداخلة",
         "الفرافرة",
   "باريس",
         "بلاط",
   "مدينة موط",

   "هناسيا",
   "الفشن",
         "الواسطى",
   "ببا",
         "بني سويف الجديدة",
   "سمسطا",
          "مدينة بني سويف",
         "ناصر",

   "حي الجنوب",
   "حي الزهور",
         "حي الشرق",
   "حي الضواحي",
         "حي العرب",
   "حي المناخ",
          "مدينة بورفؤاد",

   "أبو رديس",
   "أبو زنيمة",
         "دهب",
   "راس سدر",
         "سانت كاترين",
   "شرم الشيخ",
         "طابا",
         "طور سيناء",
         "نويبع",

   "الزرقا",
   "السرو",
         "دمياط الجديدة",
   "رأس البر",
         "عزبة البرج",
   "فارسكور",
         "كفر البطيخ",
         "كفر سعد",
         "مدينة دمياط",
         "مركز الروضة",
         "ميت أبوغالب",

   "خميم",
   "البلينا",
         "العسيرات",
   "المراغة",
         "المنشاة",
   "جرجا",
         "ساقلتة",
         "سوهاج الجديدة",
         "طما",
         "طهطا",
         "مركز جهينة",
         "مركز دار السلام",
         "مركز سوهاج",


   "الحسنة",
   "الشيخ زويد",
         "العريش",
   "بئر العبد",
         "رفح",
         "نخل",

   "أبو تشت",
   "الوقف",
         "دشنا",
   "فرشوط",
         "قفط",
         "قوص",
        "مدينة قنا",
         "نجع حمادي",
         "نقادة",

   "البرلس",
   "الحامول",
         "الرياض",
   "بلطيم",
         "بيلا",
         "دسوق",
        "سيدى سالم",
         "فوه",
         "قلين",
         "مدينة كفر الشيخ",
   "مطوبس",

   "الحمام",
   "الساحل الشمالي",
         "السلوم",
   "الضبعة",
         "العلمين",
         "النجيلة",
        "براني",
         "سيوة",
         "مرسى مطروح",


];

}
?>
